КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_СервисФизическихЛиц/КонтурЛогистика_СервисФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_СервисФизическихЛиц</name>
  <resources>
    <name>PersonId</name>
    <comment>Идентификатор физического лица в сервисе физ лиц. У одного сотрудника будут разные id в разных организациях</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>UserId</name>
    <comment>Идентификатор связанного портального пользователя. Появляется после принятия приглашения. Для водителей связка выполняется по номеру телефона. Для разных personId может быть один UserId</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыФизическихЛиц</types>
    </type>
  </resources>
  <attributes>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОшибка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>InviteId</name>
    <comment>Идентификатор приглашения</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СНИЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонОсновной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВУДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВУНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВУСерия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IdentityDocumentId</name>
    <comment>Идентификатор документа в сервисе физ. лиц</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонСовпадает</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СценарийПриглашения</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СценарииПриглашенийФизическихЛиц</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_СтатусыФизическихЛиц/КонтурЛогистика_СтатусыФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_СтатусыФизическихЛиц</name>
  <enumValues>
    <name>НеСоздано</name>
  </enumValues>
  <enumValues>
    <name>НеОтправленоПриглашение</name>
  </enumValues>
  <enumValues>
    <name>ОтправленоПриглашение</name>
  </enumValues>
  <enumValues>
    <name>ПринятоПриглашение</name>
  </enumValues>
  <enumValues>
    <name>Удалено</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_МастерДанныеСотрудников/КонтурЛогистика_МастерДанныеСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_МастерДанныеСотрудников</name>
  <enumValues>
    <name>Модуль1с</name>
  </enumValues>
  <enumValues>
    <name>Сервис</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_СценарииПриглашенийФизическихЛиц/КонтурЛогистика_СценарииПриглашенийФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_СценарииПриглашенийФизическихЛиц</name>
  <enumValues>
    <name>Водитель</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_СервисФизическихЛиц/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтображатьДанныеСотрудникаИзСервиса = Запись.Статус = Перечисления.КонтурЛогистика_СтатусыФизическихЛиц.ПринятоПриглашение;
	
	Если ОтображатьДанныеСотрудникаИзСервиса Тогда
		ОбновитьДанные();
	КонецЕсли;
	
	МастерДанныеСотрудников = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("МастерДанныеСотрудников");
	Если МастерДанныеСотрудников = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_МастерДанныеСотрудников.Модуль1с") Тогда
		Элементы.Переместить(Элементы.ГруппаРасхождения1С, Элементы.ГруппаРасхождения, Элементы.ГруппаРасхожденияСервис);
		Элементы.Переместить(Элементы.ГруппаСинхронизировать, Элементы.ГруппаРасхождения, Элементы.ГруппаРасхожденияСервис);
	КонецЕсли;
	
	ЭлементыДляРазрешенияРедактирования = Новый Массив;
	ЭлементыДляРазрешенияРедактирования.Добавить("Сотрудник");
	ЭлементыДляРазрешенияРедактирования.Добавить("Организация");
	ЭлементыДляРазрешенияРедактирования.Добавить("СценарийПриглашения");
	ЭлементыДляРазрешенияРедактирования.Добавить("Статус");
	ЭлементыДляРазрешенияРедактирования.Добавить("PersonId");
	ЭлементыДляРазрешенияРедактирования.Добавить("UserId");
	ЭлементыДляРазрешенияРедактирования.Добавить("InviteId");
	ЭлементыДляРазрешенияРедактирования.Добавить("IdentityDocumentId");
	ЭлементыДляРазрешенияРедактирования.Добавить("ТелефонСовпадает");
	
	КонтурЛогистика_ОбщегоНазначенияСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка, ЭлементыДляРазрешенияРедактирования);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УправлениеЭлементамиФормы();
	
	ЭтаФорма.Прочитать();
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЭтоИнтерфейс82() Тогда
		Элементы.ТекстИнформация.Высота = 3;
		Элементы.ЗаголовокРасхожденияСервис.Высота = 2;
		Элементы.ЗаголовокРасхождения1С.Высота = 2;
		Элементы.ФормаЗакрыть.Отображение = ОтображениеКнопки.Текст;
		Элементы.ФормаПеречитать.ТолькоВоВсехДействиях = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьДанныеИзСервиса(Команда)
	
	ОбновитьДанные();
	
	ЭтаФорма.Прочитать();
	
	Оповестить("КонтурЛогистика_ОбновитьФизическиеЛица");
	
КонецПроцедуры

&НаКлиенте
Процедура ДействиеПоУмолчанию(Команда)
	
	Если Действие = "Переотправить" Тогда
		
		ВыполнитьПереотправкуПриглашения();
		
	ИначеЕсли Действие = "Проверить" Тогда
		
		КонтурЛогистика_СервисФизическихЛицСервер.ПроверитьПриглашение(
			Запись.Организация, 
			Запись.Сотрудник, 
			ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СценарииПриглашенийФизическихЛиц.Водитель"), 
			Запись.PersonId);
			
			Сообщить("Проверка приглашения выполнена");
			
		ОтображатьДанныеСотрудникаИзСервиса = Запись.Статус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыФизическихЛиц.ПринятоПриглашение");
			
	КонецЕсли;
	
	ЭтаФорма.Прочитать();
	УправлениеЭлементамиФормы();
	
	Оповестить("КонтурЛогистика_ОбновитьФизическиеЛица");
	
КонецПроцедуры

&НаКлиенте
Процедура Синхронизировать(Команда)
	
	Если ДействиеСинхронизации = "ЗагрузитьИзСервиса" Тогда
			
		КонтурЛогистика_СервисФизическихЛицСервер.ЗагрузитьДанныеСотрудникаИзСервисаПоПриглашению(
			Запись.Организация, Запись.Сотрудник, Запись.PersonId, Запись.Статус);
			
			Сообщить("Данные сотрудника обновлены");
		
	ИначеЕсли ДействиеСинхронизации = "ВыгрузитьВСервис" Тогда
			
		ИдДокумента = "";
		СотрудникВУСерия = КонтурЛогистика_ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта_КонтурЛогистика(Запись.Сотрудник, "ВУСерия");
		СотрудникВУНомер = КонтурЛогистика_ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта_КонтурЛогистика(Запись.Сотрудник, "ВУНомер");
		Если СокрЛП(Запись.ВУСерия) = СокрЛП(СотрудникВУСерия) И СокрЛП(Запись.ВУНомер) = СокрЛП(СотрудникВУНомер) Тогда
			ИдДокумента = Запись.IdentityDocumentId;
		КонецЕсли;
		
		КонтурЛогистика_СервисФизическихЛицСервер.ВыгрузитьДанныеСотрудникаВСервисПоПриглашению(
			Запись.Организация, Запись.Сотрудник, Запись.PersonId, ИдДокумента);
			
			Сообщить("Данные сотрудника выгружены в сервис");
		
	КонецЕсли;
	
	ЭтаФорма.Прочитать();
	
	Оповестить("КонтурЛогистика_ОбновитьФизическиеЛица");
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереотправитьПриглашение(Команда)
	
	ВыполнитьПереотправкуПриглашения();
	
	ЭтаФорма.Прочитать();
	УправлениеЭлементамиФормы();
	
	Оповестить("КонтурЛогистика_ОбновитьФизическиеЛица");
	
КонецПроцедуры

&НаКлиенте
Процедура РазрешитьРедактированиеРеквизитов(Команда)
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.РазрешитьРедактированиеРеквизитов(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыполнитьПереотправкуПриглашения()
	
	РезультатПроверки = КонтурЛогистика_СервисФизическихЛицСервер.ПроверитьДаныеПередОтправкойПриглашения(
			Запись.Организация, Запись.Сотрудник, Запись.СценарийПриглашения, Запись.Телефон, Истина);
	Если Не РезультатПроверки Тогда
		Возврат;
	КонецЕсли;
	
	Результат = КонтурЛогистика_СервисФизическихЛицСервер.ОтправитьПриглашение(
		Запись.Организация, Запись.Сотрудник, Запись.СценарийПриглашения, Запись.Телефон, Запись.Статус, Запись.PersonId);
		
	Если Результат.ЕстьОшибка Тогда
		Сообщить(Результат.ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанные()
	
	КонтурЛогистика_СервисФизическихЛицСервер.ОбновитьФизическоеЛицоСотрудника(Запись.Организация, Запись.Сотрудник, Запись.PersonId);
	
КонецПроцедуры

&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	Если Запись.Статус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыФизическихЛиц.НеСоздано")
		Или Запись.Статус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыФизическихЛиц.НеОтправленоПриглашение") 
		Или Запись.Статус.Пустая() Тогда
		Элементы.ДействиеПоУмолчанию.Заголовок = "Переотправить";
		Действие = "Переотправить";
	ИначеЕсли Запись.Статус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыФизическихЛиц.ОтправленоПриглашение") Тогда
		Элементы.ДействиеПоУмолчанию.Заголовок = "Проверить";
		Действие = "Проверить";
	Иначе
		Элементы.ДействиеПоУмолчанию.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.ОписаниеОшибки.Видимость = ЗначениеЗаполнено(Запись.ОписаниеОшибки);	
	
	КрасныйЦвет = Новый Цвет(255, 0, 0);
	ЦветФонаФормы = Новый Цвет(255, 255, 255);
	ЦветТекстаФормы = Новый Цвет(51, 51, 51);
	
	Если ОтображатьДанныеСотрудникаИзСервиса Тогда 
		
		Результат = КонтурЛогистика_СервисФизическихЛицСервер.ПолучитьРасхождения(Запись);		
		ЕстьРасхождения = Результат.ЕстьРасхождения;
		
		Для каждого Реквизит Из Результат.Реквизиты Цикл
			
			Если Реквизит.Значение Тогда
				
				Если МастерДанныеСотрудников = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_МастерДанныеСотрудников.Сервис") Тогда
					
					Элементы["Сотрудник" + Реквизит.Ключ].ЦветТекста = КрасныйЦвет;
					Элементы[Реквизит.Ключ].ЦветТекста = КрасныйЦвет;
					Элементы["Сотрудник" + Реквизит.Ключ].Доступность = Истина;					
					
				Иначе
					
					Элементы[Реквизит.Ключ].ЦветТекста = КрасныйЦвет;
					Элементы["Сотрудник" + Реквизит.Ключ].ЦветТекста = КрасныйЦвет;
					Элементы[Реквизит.Ключ].Доступность = Истина;					
				КонецЕсли;
				
				Элементы["ПустойРеквизитСервис" + Реквизит.Ключ].Видимость = Ложь;
				Элементы["ПустойРеквизит1с" + Реквизит.Ключ].Видимость = Ложь;
				
			Иначе
				
				Если МастерДанныеСотрудников = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_МастерДанныеСотрудников.Сервис") Тогда
				
					Элементы["Сотрудник" + Реквизит.Ключ].ЦветТекстаЗаголовка = ЦветФонаФормы;
					Элементы["Сотрудник" + Реквизит.Ключ].ЦветТекста = ЦветФонаФормы;
					Элементы["Сотрудник" + Реквизит.Ключ].ЦветРамки = ЦветФонаФормы;
					Элементы[Реквизит.Ключ].ЦветТекста = ЦветТекстаФормы;
					
					Элементы["ПустойРеквизитСервис" + Реквизит.Ключ].Видимость = Ложь;
					Элементы["ПустойРеквизит1с" + Реквизит.Ключ].Видимость = Истина;
					
					Элементы["Сотрудник" + Реквизит.Ключ].Видимость = Ложь;
					
				Иначе
					
					Элементы[Реквизит.Ключ].ЦветТекстаЗаголовка = ЦветФонаФормы;
					Элементы[Реквизит.Ключ].ЦветТекста = ЦветФонаФормы;
					Элементы[Реквизит.Ключ].ЦветРамки = ЦветФонаФормы;
					Элементы["Сотрудник" + Реквизит.Ключ].ЦветТекста = ЦветТекстаФормы;
					
					Элементы["ПустойРеквизит1с" + Реквизит.Ключ].Видимость = Ложь;
					Элементы["ПустойРеквизитСервис" + Реквизит.Ключ].Видимость = Истина;
											
					Элементы[Реквизит.Ключ].Видимость = Ложь;
					
				КонецЕсли;
					
			КонецЕсли;
			
		КонецЦикла;
		
		Если МастерДанныеСотрудников = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_МастерДанныеСотрудников.Модуль1с") Тогда
			
			Элементы.ФормаСинхронизировать.Заголовок = "Выгрузить";
			ДействиеСинхронизации = "ВыгрузитьВСервис";
			
			Информация = Новый Массив;
			Информация.Добавить(Новый ФорматированнаяСтрока("В карточке могут быть показаны несоответствия данных сотрудника в 1С и в сервисе Контур.Логистика. "));
			Информация.Добавить(Новый ФорматированнаяСтрока("Если расхождения найдены, то исправьте их и загрузите в сервис с помощью кнопки ""Выгрузить в сервис"". "));
			Информация.Добавить(Новый ФорматированнаяСтрока("Согласованные данные предотвратят ошибки при работе сотрудника с документами. "));
			Информация.Добавить(Новый ФорматированнаяСтрока("Подробнее в "));
			Информация.Добавить(Новый ФорматированнаяСтрока("инструкции",,,, "https://support.kontur.ru/logistika-1s/56877-ispravlenie_rasxozhdenij_v_dannyx_voditelya"));
			Элементы.ТекстИнформация.Заголовок = Новый ФорматированнаяСтрока(Информация);
			
		Иначе
			
			Элементы.ФормаСинхронизировать.Заголовок = "Загрузить";
			ДействиеСинхронизации = "ЗагрузитьИзСервиса";
			
			Информация = Новый Массив;
			Информация.Добавить(Новый ФорматированнаяСтрока("В карточке могут быть показаны несоответствия данных сотрудника в 1С и в сервисе Контур.Логистика. "));
			Информация.Добавить(Новый ФорматированнаяСтрока("Если есть расхождения, то обновите данные сотрудника из сервиса с помощью кнопки ""Загрузить из сервиса"". "));
			Информация.Добавить(Новый ФорматированнаяСтрока("Согласованные данные предотвратят ошибки при работе сотрудника с документами. "));
			Информация.Добавить(Новый ФорматированнаяСтрока("Подробнее в "));
			Информация.Добавить(Новый ФорматированнаяСтрока("инструкции",,,, "https://support.kontur.ru/logistika-1s/56877-ispravlenie_rasxozhdenij_v_dannyx_voditelya"));
			Информация.Добавить(Новый ФорматированнаяСтрока("."));
			Элементы.ТекстИнформация.Заголовок = Новый ФорматированнаяСтрока(Информация);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ГруппаРасхождения.Видимость = ОтображатьДанныеСотрудникаИзСервиса;
	Элементы.ГруппаРасхождения1С.Видимость = ЕстьРасхождения;
	Элементы.ГруппаРасхожденияСервис.Видимость = ЕстьРасхождения;
	Элементы.ГруппаИнформация.Видимость = ОтображатьДанныеСотрудникаИзСервиса;
	
	Элементы.ЗаголовокРасхожденияСервис.Видимость = ЕстьРасхождения; 
	Элементы.ЗаголовокРасхождения1С.Видимость = ЕстьРасхождения;
	
	Элементы.ФормаОбновитьДанныеИзСервиса.Видимость = ОтображатьДанныеСотрудникаИзСервиса;
	Элементы.ГруппаСинхронизировать.Видимость = ЕстьРасхождения;
	
	Элементы.ФормаПереотправитьПриглашение.Видимость = Запись.Статус = Перечисления.КонтурЛогистика_СтатусыФизическихЛиц.ОтправленоПриглашение;
	
КонецПроцедуры

#КонецОбласти
